//6. email контрагентов

ВЫБРАТЬ
	КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка,
	КонтрагентыКонтактнаяИнформация.НомерСтроки КАК НомерСтроки,
	КонтрагентыКонтактнаяИнформация.Тип КАК Тип,
	КонтрагентыКонтактнаяИнформация.Вид КАК Вид,
	КонтрагентыКонтактнаяИнформация.Значение КАК Значение
ИЗ
	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
ГДЕ 
	КонтрагентыКонтактнаяИнформация.Значение <> ""
	И КонтрагентыКонтактнаяИнформация.Тип = &Тип
	И КонтрагентыКонтактнаяИнформация.Вид = &Вид
