//11. Список товаров документа "Заказ клиента" с номером "000..05"

ВЫБРАТЬ
	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки,
	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	ЗаказКлиентаТовары.Количество КАК Количество,
	ЗаказКлиентаТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	ЗаказКлиентаТовары.Цена КАК Цена,
	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
	ЗаказКлиентаТовары.Сумма КАК Сумма,
	ЗаказКлиентаТовары.СуммаНДС КАК СуммаНДС,
	ЗаказКлиентаТовары.СуммаВсего КАК СуммаВсего
ИЗ
	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
ГДЕ
	ЗаказКлиентаТовары.Ссылка.Номер = "00000000005"
