//Получить остатки всех товаров, входящих в группу "Бытовая техника", а так же во все вложенные группы

ВЫБРАТЬ
	ТоварыНаСкладахОстатки.Организация КАК Организация,
	ТоварыНаСкладахОстатки.Склад КАК Склад,
	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток
ИЗ
	РегистрНакопления.ТоварыНаСкладах.Остатки(
			,
			Номенклатура В ИЕРАРХИИ
				(ВЫБРАТЬ
					Номенклатура.Ссылка КАК Ссылка
				ИЗ
					Справочник.Номенклатура КАК Номенклатура
				ГДЕ
					Номенклатура.Ссылка = &ГруппаТоваров)) КАК ТоварыНаСкладахОстатки
