// Получить актуальные на выбранную дату цены (на все товаы с видом номенклатуры "Мобильные телефоны"
ВЫБРАТЬ
	ЦеныНоменклатурыСрезПоследних.Период КАК Период,
	ЦеныНоменклатурыСрезПоследних.ВидЦен КАК ВидЦен,
	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
ИЗ
	РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
ГДЕ
	ЦеныНоменклатурыСрезПоследних.Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
	И ЦеныНоменклатурыСрезПоследних.ВидЦен = &ВидЦен
