//Получить остатки товаров, по которым были продажи за последний месяц.
//Товары , которых нет в остатке, также должны попасть в результат 

ВЫБРАТЬ
	ПродажиОбороты.Номенклатура КАК Номенклатура,
	ПродажиОбороты.КоличествоОборот КАК ПроданоЗаПериод,
	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Остаток
ИЗ
	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Месяц, ) КАК ПродажиОбороты
		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&ДатаОкончания, ) КАК ТоварыНаСкладахОстатки
		ПО ПродажиОбороты.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
