//Получить цены и остатки мобильных телефонов.
//Товары, которых нет в остатке, или не установлена цена, должны попасть в результат

ВЫБРАТЬ
	СпрНоменклатура.Ссылка КАК СпрСсылка,
	СпрНоменклатура.Код КАК Код,
	СпрНоменклатура.Наименование КАК Наименование,
	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
ИЗ
	Справочник.Номенклатура КАК СпрНоменклатура
		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
		ПО СпрНоменклатура.Ссылка = ТоварыНаСкладахОстатки.Номенклатура
		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦен = &ВидЦенОптовая) КАК ЦеныНоменклатурыСрезПоследних
		ПО СпрНоменклатура.Ссылка = ЦеныНоменклатурыСрезПоследних.Номенклатура
ГДЕ
	СпрНоменклатура.Ссылка В ИЕРАРХИИ(&ГруппаСмартфоны)
