//Получить подробную информацию об остатках и резервах номенклатуры.
//Информацию об остатках нужно получать из регистра накопления "Товары на складах".
//Информацию о резервах - из регистра накопления  "Товары в резерве".
//Свободный остаток рассчитывать по формуле
//Свободный остаток = Остаток - Резерв
//Товары, которых нет в остатке выводить в таблицу не нужно
ВЫБРАТЬ
	ТоварыНаСкладахОстатки.Склад КАК Склад,
	СпрНоменклатура.Ссылка КАК Ссылка,
	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Остаток,
	ТоварыВРезервеОстатки.КоличествоОстаток КАК Резерв,
	ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеОстатки.КоличествоОстаток, 0) КАК СвободныйОстаток
ИЗ
	Справочник.Номенклатура КАК СпрНоменклатура
		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
		ПО СпрНоменклатура.Ссылка = ТоварыНаСкладахОстатки.Номенклатура
		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезерве.Остатки КАК ТоварыВРезервеОстатки
		ПО СпрНоменклатура.Ссылка = ТоварыВРезервеОстатки.Номенклатура
ГДЕ
	ТоварыНаСкладахОстатки.КоличествоОстаток <> 0
