//Получить список документов закупки в хронологическом порядке
ВЫБРАТЬ
	ПриходнаяНакладная.Дата КАК Дата,
	ПриходнаяНакладная.Номер КАК Номер,
	ПриходнаяНакладная.Ссылка КАК Ссылка,
	ПриходнаяНакладная.Контрагент КАК Контрагент,
	ПриходнаяНакладная.СуммаДокумента КАК СуммаДокумента
ИЗ
	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	ЗаказПоставщику.Дата,
	ЗаказПоставщику.Номер,
	ЗаказПоставщику.Ссылка,
	ЗаказПоставщику.Контрагент,
	ЗаказПоставщику.СуммаДокумента
ИЗ
	Документ.ЗаказПоставщику КАК ЗаказПоставщику

УПОРЯДОЧИТЬ ПО
	Дата
