//Получить список документов продажи в хронологическом порядке
ВЫБРАТЬ
	ЗаказКлиента.Дата КАК Дата,
	ЗаказКлиента.Номер КАК Номер,
	ЗаказКлиента.Ссылка КАК Ссылка,
	ЗаказКлиента.Контрагент КАК Контрагент,
	ЗаказКлиента.СуммаДокумента КАК СуммаДокумента
ИЗ
	Документ.ЗаказКлиента КАК ЗаказКлиента

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	РасходнаяНакладная.Дата,
	РасходнаяНакладная.Номер,
	РасходнаяНакладная.Ссылка,
	РасходнаяНакладная.Контрагент,
	РасходнаяНакладная.СуммаДокумента
ИЗ
	Документ.РасходнаяНакладная КАК РасходнаяНакладная

УПОРЯДОЧИТЬ ПО
	Дата
